Revit 2024 API
UpdaterId.GetAddInId Method
 AddInId of the UpdaterId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public AddInId GetAddInId()
Visual Basic
Public Function GetAddInId As AddInId
Visual C++
public:
AddInId^ GetAddInId()
See Also
UpdaterId Class
Autodesk.Revit.DB Namespace